In [20]:
import pandas as pd
import numpy as np

file = 'Players.csv'
df = pd.read_csv(file)
df.head(5)

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state
0,0,Curly Armstrong,180.0,77.0,Indiana University,1918.0,NaN,NaN
1,1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
2,2,Leo Barnhorst,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN
3,3,Ed Bartels,196.0,88.0,North Carolina State University,1925.0,NaN,NaN
4,4,Ralph Beard,178.0,79.0,University of Kentucky,1927.0,Hardinsburg,Kentucky

In [8]:
dfa = pd.DataFrame(np.arange(15).reshape(5,3))
dfb = pd.DataFrame((np.arange(9)**2).reshape(3,3))
dfb

    0   1   2
0   0   1   4
1   9  16  25
2  36  49  64

In [11]:
pd.concat([dfa,dfb], ignore_index=True)

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14
5   0   1   4
6   9  16  25
7  36  49  64

In [19]:
df1 = pd.DataFrame({'id':[1,2,3], 'cor': ['Branco', "Preto", 'Verde']})
df2 = pd.DataFrame({'times':['Time1', 'Time2', 'Time3', 'Time4', 'Time5'], 'id_cor': [1,1,2,3,2]})
#pd.merge(df1,df2)
pd.merge(df1, df2, left_on='id', right_on='id_cor')

   id     cor  times  id_cor
0   1  Branco  Time1       1
1   1  Branco  Time2       1
2   2   Preto  Time3       2
3   2   Preto  Time5       2
4   3   Verde  Time4       3